In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Nombre': ['Ana', 'Luis', 'Carlos']})
df2 = pd.DataFrame({'ID': [1, 2, 4],
                    'Edad': [25, 30, 22]})

In [3]:
df1

   ID  Nombre
0   1     Ana
1   2    Luis
2   3  Carlos

In [4]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    22

In [6]:
df_combinado = pd.merge(df1, df2, on = 'ID')#por defecto el HOW viene en inner
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30

In [7]:
df_combinado = pd.merge(df1, df2, on = 'ID', how = 'outer')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN
3   4     NaN  22.0

In [8]:
df_combinado = pd.merge(df1, df2, on = 'ID', how = 'right')
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30
2   4    NaN    22

In [9]:
df_combinado = pd.merge(df1, df2, on = 'ID', how = 'left')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN

In [10]:
df_combinado = pd.merge(df1, df2, left_index = True, right_index = True)
df_combinado

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2    Luis     2    30
2     3  Carlos     4    22